<?xml version="1.0" ?>
<net name="best" version="10">
	<layers>
		<layer id="0" name="images" type="Parameter" version="opset1">
			<data element_type="f32" shape="1,3,640,640"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>640</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Slice_4/Cast_123079_const" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Slice_4/Cast_223081_const" type="Const" version="opset1">
			<data element_type="i64" offset="32" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Slice_4/Cast_323083_const" type="Const" version="opset1">
			<data element_type="i64" offset="64" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Slice_4" type="StridedSlice" version="opset1">
			<data begin_mask="1,1,1,1" ellipsis_mask="0,0,0,0" end_mask="1,1,0,1" new_axis_mask="0,0,0,0" shrink_axis_mask="0,0,0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>640</dim>
					<dim>640</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
				<port id="2">
					<dim>4</dim>
				</port>
				<port id="3">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>320</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Slice_9/Cast_122999_const" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Slice_9/Cast_223001_const" type="Const" version="opset1">
			<data element_type="i64" offset="96" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Slice_9/Cast_323003_const" type="Const" version="opset1">
			<data element_type="i64" offset="128" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Slice_9" type="StridedSlice" version="opset1">
			<data begin_mask="1,1,1,1" ellipsis_mask="0,0,0,0" end_mask="1,1,1,0" new_axis_mask="0,0,0,0" shrink_axis_mask="0,0,0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>320</dim>
					<dim>640</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
				<port id="2">
					<dim>4</dim>
				</port>
				<port id="3">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Slice_14/Cast_123033_const" type="Const" version="opset1">
			<data element_type="i64" offset="160" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Slice_14/Cast_223035_const" type="Const" version="opset1">
			<data element_type="i64" offset="32" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Slice_14/Cast_323037_const" type="Const" version="opset1">
			<data element_type="i64" offset="64" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Slice_14" type="StridedSlice" version="opset1">
			<data begin_mask="1,1,0,1" ellipsis_mask="0,0,0,0" end_mask="1,1,0,1" new_axis_mask="0,0,0,0" shrink_axis_mask="0,0,0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>640</dim>
					<dim>640</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
				<port id="2">
					<dim>4</dim>
				</port>
				<port id="3">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>320</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Slice_19/Cast_123149_const" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Slice_19/Cast_223151_const" type="Const" version="opset1">
			<data element_type="i64" offset="96" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Slice_19/Cast_323153_const" type="Const" version="opset1">
			<data element_type="i64" offset="128" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Slice_19" type="StridedSlice" version="opset1">
			<data begin_mask="1,1,1,1" ellipsis_mask="0,0,0,0" end_mask="1,1,1,0" new_axis_mask="0,0,0,0" shrink_axis_mask="0,0,0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>320</dim>
					<dim>640</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
				<port id="2">
					<dim>4</dim>
				</port>
				<port id="3">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Slice_24/Cast_123155_const" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Slice_24/Cast_223157_const" type="Const" version="opset1">
			<data element_type="i64" offset="32" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Slice_24/Cast_323159_const" type="Const" version="opset1">
			<data element_type="i64" offset="64" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Slice_24" type="StridedSlice" version="opset1">
			<data begin_mask="1,1,1,1" ellipsis_mask="0,0,0,0" end_mask="1,1,0,1" new_axis_mask="0,0,0,0" shrink_axis_mask="0,0,0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>640</dim>
					<dim>640</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
				<port id="2">
					<dim>4</dim>
				</port>
				<port id="3">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>320</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Slice_29/Cast_122923_const" type="Const" version="opset1">
			<data element_type="i64" offset="192" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Slice_29/Cast_222925_const" type="Const" version="opset1">
			<data element_type="i64" offset="96" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Slice_29/Cast_322927_const" type="Const" version="opset1">
			<data element_type="i64" offset="128" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Slice_29" type="StridedSlice" version="opset1">
			<data begin_mask="1,1,1,0" ellipsis_mask="0,0,0,0" end_mask="1,1,1,0" new_axis_mask="0,0,0,0" shrink_axis_mask="0,0,0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>320</dim>
					<dim>640</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
				<port id="2">
					<dim>4</dim>
				</port>
				<port id="3">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Slice_34/Cast_123111_const" type="Const" version="opset1">
			<data element_type="i64" offset="160" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Slice_34/Cast_223113_const" type="Const" version="opset1">
			<data element_type="i64" offset="32" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Slice_34/Cast_323115_const" type="Const" version="opset1">
			<data element_type="i64" offset="64" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Slice_34" type="StridedSlice" version="opset1">
			<data begin_mask="1,1,0,1" ellipsis_mask="0,0,0,0" end_mask="1,1,0,1" new_axis_mask="0,0,0,0" shrink_axis_mask="0,0,0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>640</dim>
					<dim>640</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
				<port id="2">
					<dim>4</dim>
				</port>
				<port id="3">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>320</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Slice_39/Cast_123087_const" type="Const" version="opset1">
			<data element_type="i64" offset="192" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Slice_39/Cast_223089_const" type="Const" version="opset1">
			<data element_type="i64" offset="96" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Slice_39/Cast_323091_const" type="Const" version="opset1">
			<data element_type="i64" offset="128" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Slice_39" type="StridedSlice" version="opset1">
			<data begin_mask="1,1,1,0" ellipsis_mask="0,0,0,0" end_mask="1,1,1,0" new_axis_mask="0,0,0,0" shrink_axis_mask="0,0,0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>320</dim>
					<dim>640</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
				<port id="2">
					<dim>4</dim>
				</port>
				<port id="3">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Concat_40" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>3</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>3</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>12</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="onnx_initializer_node_model.0.conv.conv.weight/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="224" shape="64,12,3,3" size="27648"/>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>12</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Conv_41/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>12</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>12</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Conv_41/Dims6141/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="27872" shape="1,64,1,1" size="256"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Conv_41" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="LeakyRelu_4215880/Cast_122943_const" type="Const" version="opset1">
			<data element_type="f32" offset="28128" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="LeakyRelu_4215880" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="onnx_initializer_node_model.1.conv.weight/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="28132" shape="128,64,3,3" size="294912"/>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Conv_43/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Conv_43/Dims6189/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="323044" shape="1,128,1,1" size="512"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Conv_43" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="LeakyRelu_4415964/Cast_123061_const" type="Const" version="opset1">
			<data element_type="f32" offset="28128" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="LeakyRelu_4415964" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="onnx_initializer_node_model.2.cv1.conv.weight/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="323556" shape="64,128,1,1" size="32768"/>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Conv_45/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Conv_45/Dims6105/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="356324" shape="1,64,1,1" size="256"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Conv_45" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="LeakyRelu_4615896/Cast_123075_const" type="Const" version="opset1">
			<data element_type="f32" offset="28128" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="LeakyRelu_4615896" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="onnx_initializer_node_model.2.m.0.cv1.conv.weight/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="356580" shape="64,64,1,1" size="16384"/>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Conv_47/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Conv_47/Dims6153/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="372964" shape="1,64,1,1" size="256"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Conv_47" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="LeakyRelu_4815928/Cast_123009_const" type="Const" version="opset1">
			<data element_type="f32" offset="28128" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="LeakyRelu_4815928" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="onnx_initializer_node_model.2.m.0.cv2.conv.weight/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="373220" shape="64,64,3,3" size="147456"/>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Conv_49/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Conv_49/Dims6207/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="520676" shape="1,64,1,1" size="256"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Conv_49" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="LeakyRelu_5015924/Cast_122947_const" type="Const" version="opset1">
			<data element_type="f32" offset="28128" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="LeakyRelu_5015924" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Add_51" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="onnx_initializer_node_model.2.m.1.cv1.conv.weight/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="520932" shape="64,64,1,1" size="16384"/>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Conv_52/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Conv_52/Dims6291/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="537316" shape="1,64,1,1" size="256"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Conv_52" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="LeakyRelu_5316104/Cast_122885_const" type="Const" version="opset1">
			<data element_type="f32" offset="28128" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="LeakyRelu_5316104" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="onnx_initializer_node_model.2.m.1.cv2.conv.weight/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="537572" shape="64,64,3,3" size="147456"/>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Conv_54/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Conv_54/Dims5847/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="685028" shape="1,64,1,1" size="256"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Conv_54" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="LeakyRelu_5516068/Cast_123057_const" type="Const" version="opset1">
			<data element_type="f32" offset="28128" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="LeakyRelu_5516068" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Add_56" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="onnx_initializer_node_model.2.m.2.cv1.conv.weight/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="685284" shape="64,64,1,1" size="16384"/>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Conv_57/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Conv_57/Dims6297/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="701668" shape="1,64,1,1" size="256"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Conv_57" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="LeakyRelu_5815792/Cast_122995_const" type="Const" version="opset1">
			<data element_type="f32" offset="28128" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="LeakyRelu_5815792" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="onnx_initializer_node_model.2.m.2.cv2.conv.weight/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="701924" shape="64,64,3,3" size="147456"/>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Conv_59/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Conv_59/Dims6129/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="849380" shape="1,64,1,1" size="256"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Conv_59" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="LeakyRelu_6015872/Cast_122905_const" type="Const" version="opset1">
			<data element_type="f32" offset="28128" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="LeakyRelu_6015872" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Add_61" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="onnx_initializer_node_model.2.cv3.weight/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="849636" shape="64,64,1,1" size="16384"/>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Conv_62" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="onnx_initializer_node_model.2.cv2.weight/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="866020" shape="64,128,1,1" size="32768"/>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Conv_63" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Concat_64" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="data_mul_9630/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="898788" shape="1,128,1,1" size="512"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="BatchNormalization_65/mean/Fused_Mul_" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="data_add_9632/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="899300" shape="1,128,1,1" size="512"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="BatchNormalization_65/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="LeakyRelu_6615844/Cast_122933_const" type="Const" version="opset1">
			<data element_type="f32" offset="28128" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="LeakyRelu_6615844" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="onnx_initializer_node_model.2.cv4.conv.weight/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="899812" shape="128,128,1,1" size="65536"/>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Conv_67/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Conv_67/Dims5973/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="965348" shape="1,128,1,1" size="512"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Conv_67" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="LeakyRelu_6815876/Cast_122895_const" type="Const" version="opset1">
			<data element_type="f32" offset="28128" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="LeakyRelu_6815876" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="onnx_initializer_node_model.3.conv.weight/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="965860" shape="256,128,3,3" size="1179648"/>
			<output>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Conv_69/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Conv_69/Dims6171/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="2145508" shape="1,256,1,1" size="1024"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Conv_69" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="LeakyRelu_7015996/Cast_123085_const" type="Const" version="opset1">
			<data element_type="f32" offset="28128" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="LeakyRelu_7015996" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="onnx_initializer_node_model.4.cv1.conv.weight/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="2146532" shape="128,256,1,1" size="131072"/>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="Conv_71/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="Conv_71/Dims5985/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="2277604" shape="1,128,1,1" size="512"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="Conv_71" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="LeakyRelu_7215980/Cast_123093_const" type="Const" version="opset1">
			<data element_type="f32" offset="28128" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="LeakyRelu_7215980" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="onnx_initializer_node_model.4.m.0.cv1.conv.weight/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="2278116" shape="128,128,1,1" size="65536"/>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="Conv_73/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="Conv_73/Dims5997/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="2343652" shape="1,128,1,1" size="512"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="Conv_73" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="LeakyRelu_7415780/Cast_122887_const" type="Const" version="opset1">
			<data element_type="f32" offset="28128" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="LeakyRelu_7415780" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="onnx_initializer_node_model.4.m.0.cv2.conv.weight/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="2344164" shape="128,128,3,3" size="589824"/>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="Conv_75/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="Conv_75/Dims6267/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="2933988" shape="1,128,1,1" size="512"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="Conv_75" type="Add" version="opset1">
			<input>
				<port id="0">
